In [1]:
import pandas as pd
import numpy as np

In [2]:
customers = pd.read_json("customers.json")
customers.head()

       Id     NickName
0  103603  1000kgthanh
1  103760  999999999ok
2  103829       ac7ive
3       1        admin
4  103839  ahkk.nguyen

In [3]:
products = pd.read_json("products.json")
products.head()

   Id                                            Name  UnitPrice
0   1                         Build your own computer     1200.0
1   2  Digital Storm VANQUISH 3 Custom Performance PC     1259.0
2   3             Lenovo IdeaCentre 600 All-in-One PC      500.0
3   4                       Apple MacBook Pro 13-inch     1800.0
4   5                       Asus N551JK-XO076H Laptop     1500.0

In [5]:
ratings = pd.read_json("ratings.json")
ratings.head()

   CustomerID  ProductID  Rate           CreateDate
0      103416        619     1  2018/01/01 01:36:30
1      103654        411     1  2018/01/01 01:36:35
2      103954        298     3  2018/01/01 01:36:38
3      103672        361     5  2018/01/01 01:37:15
4      103960        536     5  2018/01/01 02:36:25

In [6]:
customers.shape

(678, 2)

In [7]:
products.shape

(691, 3)

In [8]:
ratings.shape

(130754, 4)

In [9]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 678 entries, 0 to 677
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Id        678 non-null    int64
 1   NickName  678 non-null    object
dtypes: int64(1), object(1)
memory usage: 10.7+ KB

In [10]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 691 entries, 0 to 690
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Id         691 non-null    int64
 1   Name       691 non-null    object
 2   UnitPrice  691 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 16.3+ KB

In [11]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130754 entries, 0 to 130753
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   CustomerID  130754 non-null  int64
 1   ProductID   130754 non-null  int64
 2   Rate        130754 non-null  int64
 3   CreateDate  130754 non-null  object
dtypes: int64(3), object(1)
memory usage: 4.0+ MB

In [12]:
customers.isna().sum()

Id          0
NickName    0
dtype: int64

In [13]:
products.isna().sum()

Id           0
Name         0
UnitPrice    0
dtype: int64

In [14]:
ratings.isna().sum()

CustomerID    0
ProductID     0
Rate          0
CreateDate    0
dtype: int64